ProyectosOpenESB/MyCalculator/build/MyCalculator.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="MyCalculator" targetNamespace="http://j2ee.netbeans.org/wsdl/MyCalculator/src/MyCalculator"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/MyCalculator/src/MyCalculator" xmlns:ns="http://xml.netbeans.org/schema/MyCalculatorSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/MyCalculator/src/MyCalculator">
            <xsd:import namespace="http://xml.netbeans.org/schema/MyCalculatorSchema" schemaLocation="MyCalculatorSchema.xsd"/>
        </xsd:schema>
    </types>
    <message name="operationRequest">
        <part name="part1" element="ns:myInput"/>
    </message>
    <message name="operationResponse">
        <part name="part1" element="ns:myOutput"/>
    </message>
    <message name="operationFault">
        <part name="part1" element="ns:myFault"/>
    </message>
    <portType name="MyCalculatorPortType">
        <operation name="additionOperation">
            <input name="input1" message="tns:operationRequest"/>
            <output name="output1" message="tns:operationResponse"/>
        </operation>
        <operation name="subtractionOperation">
            <input name="input2" message="tns:operationRequest"/>
            <output name="output2" message="tns:operationResponse"/>
        </operation>
        <operation name="multiplicationOperation">
            <input name="input3" message="tns:operationRequest"/>
            <output name="output3" message="tns:operationResponse"/>
        </operation>
        <operation name="divisionOperation">
            <input name="input4" message="tns:operationRequest"/>
            <output name="output4" message="tns:operationResponse"/>
            <fault name="fault1" message="tns:operationFault"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="MyCalculator">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="MyCalculatorPortTypeRole" portType="tns:MyCalculatorPortType"/>
    </plnk:partnerLinkType>
</definitions>
