ProyectosOpenESB/MyCalculatorCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:myc="http://xml.netbeans.org/schema/MyCalculatorSchema">
  <soapenv:Body>
    <myc:myInput>
      <myc:param01>3</myc:param01>
      <myc:param02>5</myc:param02>
    </myc:myInput>
  </soapenv:Body>
</soapenv:Envelope>